tutorials/fluidSolidInteraction/flexibleDamBreak/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.146;

vertices
(
    (2 0 0)
    (2.082191 0 0)
    (2.082191 0.547945 0)
    (2 0.547945 0)

    (2 0 0.1)
    (2.082191 0 0.1)
    (2.082191 0.547945 0.1)
    (2 0.547945 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
